Revit 2027 API
Field.ValueType Property
 The type of the values stored in the field.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Type ValueType { get; }
Public ReadOnly Property ValueType As Type
	Get
public:
property Type^ ValueType {
	Type^ get ();
}
member ValueType : Type with get
Property Value
Type
Remarks
 For key-value maps, this is the value type.
See Also
Reference
Field Class
Autodesk.Revit.DB.ExtensibleStorage Namespace